
## Plan Result (aat)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.docmosis_access_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.docmosis_access_key will be created
  + resource "azurerm_key_vault_secret" "docmosis_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.KeyVault/vaults/sptribs-aat"
      + name                    = "docmosis-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":50,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->